<template>
  <div class="sm:p-5 p-3 !pt-6">
    <div class="flex flex-col items-center">
      <div class="flex flex-col gap-4">
        <CardComment v-for="(card, index) in cards" :item="card" :key="index" />
      </div>
      <CommonButton
        variant="primary"
        label="Yana yuklash"
        class="block mt-5"
      >
        <img src="/icons/down.svg" alt="" />
      </CommonButton>
    </div>
  </div>
</template>
<script setup lang="ts">
const cards = [
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏',
  },
]
</script>
