<template>
  <div class="p-5">
    <CardComment v-for="(card, index) in cards" :item="card" :key="index" class="mb-4"/>
    <CommonButton variant="primary" label="Yana yuklash" class="mx-auto block">
      <img src="/icons/down.svg" alt="">
    </CommonButton>
  </div>
</template>
<script setup lang="ts">
const cards = [
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  }
  ,{
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  }
  ,{
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  }
  ,{
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  },
  {
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  }
  ,{
    img: '/images/profile_photo.png',
    name: 'Jasurbek Po‘latov',
    time: '17:23',
    price: 50000000,
    text: 'Пусть малышка скорее выздороит. Будем молиться и надеяться что она выздоровит как можно скорее и проживет долгую, прекрасную жизнь🙏'
  },
]
</script>